app/views/teacher/tHome.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
<% if session[:user_id] %>
        <h2><p>Welcome <%= User.find(session[:user_id]).uName %>