app/controllers/course_controller.rb

SELECT `assignments`.* FROM `assignments`
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
---
  def show
     @assgns = Assignment.all
     @course = Course.find(params[:id])

SELECT `courses`.* FROM `courses`
---
  def list
    @courses = Course.all

INSERT INTO `courses` (`cname`, `description`, `created_at`) VALUES ('math', 'Its a tricky course', '2011-07-22 19:46:33')
---
  def create
    @corse = Course.new(params[:course])
    respond_to do |format|
    if @corse.save