app/controllers/updownload_controller.rb

  def addNewAssgn
	@assgnmnt = Assignment.new
	@assgnmnt.name = params[:assignment][:name]
	@assgnmnt.guideline = params[:assignment][:guideline]
	@assgnmnt.dateOfSubmission = params[:assignment][:dateOfSubmission]
	@assgnmnt.maxMarks = params[:assignment][:maxMarks]
	@assgnmnt.course_id = params[:assignment][:maxMarks]
	@assgnmnt.teacher_id = params[:assignment][:maxMarks]
	@assgnmnt.fileName = params[:assignment][:name]
	@assgnmnt.fileType = params[:assignment][:name]
	@assgnmnt.filePath = params[:assignment][:name]
	post = Assignment.save(params[:assignment])
---
INSERT INTO `assignments` (`dateOfSubmission`, `fileType`, `fileName`, `guideline`, `created_at`, `course_id`, `teacher_id`, `maxMarks`, `name`, `filePath`) VALUES (NULL, 'gemfile', 'gemfile', 'list of all gems', '2011-07-23 00:21:02', 12, 12, 12, 'gemfile', 'gemfile')